//*Порахувати кількість чисел у послідовності Фібоначчі, менших заданого
//*натурального числа N, за допомогою рекурсії (без використання циклів).
//*Перші два значення в послідовності Фібоначчі: 0, 1. Кожне наступне
//*значення є сумою попередніх двох значень, тому послідовність приймає
//*вигляд: 0, 1, 1, 2, 3, 5, 8, 13, 21 тощо. Наприклад, при N = 10 програма має
//*видати 7.

#include <iostream>
using namespace std;

int fib(int n)
{
    if (n == 0)
        return 0;
    if (n == 1)
        return 1;

    return fib(n-1) + fib(n-2);
}

int main()
{
    int n,kol;
    cout << "Enter predel:\n> ";
    cin >> n;

    //*Выводим числа Фибоначчи которые < заданого n
    for(int count = 0; count<n; ++count){
        cout << fib(count) << endl;
        kol = count;
    }

    //!Выводим КОЛИЧЕСТВО чисел Фибоначчи которые < заданого n
    cout << "kol: " << kol << endl;

    return 0;
}
